[
  {
    "id": "3e87b2226ab5564b92a0e3523afce872",
    "timestamp": "JANUARY 21, 2026",
    "link": "https://www.counter-strike.net/newsentry/511855214544814488",
    "entry": "The Fourth Season\n\nPremier Season Four is here, and it brings a host of community content, in-game items, gameplay tweaks, and bug fixes along with it!  \nAnubis is back after a short vacation, and has several gameplay adjustments to show for it. The release notes have the full story, but let's just say it's good news for fans of holes. There have also been a couple of minor adjustments to SMGs, so if you've been waiting to add the MP7 or MP5-SD to your loadout, now is your time.\nSpeaking of which, it's time to start working toward your Season Four Medal. As before, the color of your medal will correspond to the highest CS Rating achieved during the season, and the bars will reflect your total wins, with one bar for every 25 (up to five bars). To be eligible for a medal, you'll need an account in good standing, 25 Premier match wins, and an active CSR at the end of the season.    \nCommunity Maps\nWith the new season comes a new set of community maps.  From the winding paths of Stronghold to the active volcano of Sanctum, each map brings a ton of character and gameplay ideas to the table. Stronghold, Alpine, and Warren can be found in Competitive, Casual, and Deathmatch modes, while Poseidon and Sanctum are available in Wingman.\n Weekly Care Package\nToday we are introducing two new collections to your weekly care package. One has color and the other one does not. We'll let you figure out which is which.\nLTD Edition\nThe armory also has a new entry--the AK-47 | Aphrodite. With mother-of-pearl accents and amber patina, this entry varies in both wear and pattern:",
    "image_url": "https://clan.fastly.steamstatic.com/images/3381077/11b0b1396c841807c8626f72dffd388ababb5f86.png"
  },
  {
    "id": "a1109d6191958d159e295aa10639ca37",
    "timestamp": "DECEMBER 26, 2025",
    "link": "https://www.counter-strike.net/newsentry/500593045099513267",
    "entry": "2026 Service Medal\n\nStarting January 1, 2026, the newest Service Medal will be available in-game.\n\nReach Global General (Rank 40) to reset your Profile Rank and earn (or upgrade) your 2026 Service Medal.\n\nGood luck and have fun!",
    "image_url": "https://clan.fastly.steamstatic.com/images/3381077/89ab38f84911989f17b33545d4720b9131202586.png"
  },
  {
    "id": "a33c43a90fffafa38f2d6c31bbd2e2ee",
    "timestamp": "DECEMBER 18, 2025",
    "link": "https://www.counter-strike.net/newsentry/500593045099512825",
    "entry": "The Year of the Bees\n\nThe StarLadder Budapest Major capped off an incredible 2025 for Team Vitality, who won their second consecutive Major Championship and the organization's third overall.\n\nComing into the Grand Finals against FaZe Clan, Team Vitality had not lost a map in the Playoffs, defeating The MongolZ and Team Spirit 2-0.\n\nAfter losing the opening map, Team Vitality won the next three on Dust II, Inferno, and Overpass to take the series 3-1 in Counter-Strike's first ever best of five Grand Finals.\n\n\nToday we are releasing the Budapest Champions Autograph Capsule, featuring Paper, Embroidered, Holo, and Gold stickers autographed by one of the players from Team Vitality.\n\nCongratulations again to Team Vitality, champions of the StarLadder Budapest Major and both Major Championships in 2025!",
    "image_url": "https://clan.fastly.steamstatic.com/images/3381077/2d3b82bc5a272740d2c36d2d58910702e4d13d0b.png"
  },
  {
    "id": "3747114583d573ea4e9a0882c9a9e78f",
    "timestamp": "DECEMBER 13, 2025",
    "link": "https://www.counter-strike.net/newsentry/499466596943659521",
    "entry": "Best of Five in Budapest\n\nOnly two teams remain in the StarLadder Budapest Major!\n\nTeam Vitality has yet to drop a map in the Playoffs, defeating The MongolZ in the Quarterfinals and Team Spirit in the Semifinals 2-0. \n\nOn the other side of the bracket, FaZe Clan defeated MOUZ in the Quarterfinals and needed all three maps to defeat Natus Vincere in the Semifinals, 2-1, to book their ticket to Sunday's Grand Finals.\n\nTeam Vitality are trying to win back to back Majors, a feat which hasn't been accomplished since 2019. FaZe Clan are trying to win their second Counter-Strike Major after being runners up in 2 of the last 3. \n\nCounter-Strike's first ever best of five Major Grand Finals begins tomorrow, December 14th at 18:00 CET.\n\nAs we enter the final day of the StarLadder Budapest Major, tournament stickers are still available, with 50% of the proceeds going to the players, teams, and participating organizations.\n\nSee you tomorrow for the biggest Major Grand Finals yet!",
    "image_url": "https://clan.fastly.steamstatic.com/images/3381077/91b6550211fd98cb72bb87e248f3878dd592c356.png"
  },
  {
    "id": "4939e0e0ea5af5e316a416ec1baabad6",
    "timestamp": "DECEMBER 10, 2025",
    "link": "https://www.counter-strike.net/newsentry/542250707897549188",
    "entry": "The StarLadder Budapest Major Playoffs\n\nOnly 8 teams remain in the StarLadder Budapest Major, which means the Playoffs are upon us.\n\nFURIA and Team Spirit finished Stage III with perfect 3-0 records. MOUZ, The MongolZ, and Vitality advanced at 3-1, and Falcons, FaZe Clan, and Natus Vincere survived with 3-2 records.\n\nPlayoffs begin tomorrow, December 11th from the 20,000 seat MVM Dome with the following Quarterfinals matchups:\nTeam Spirit vs. Falcons\nVitality vs. The MongolZ\nMOUZ vs. FaZe Clan\nFURIA vs. Natus Vincere\nAs the Playoffs get underway, there's still time to support your favorite teams. Team and player stickers are available, with 50% of the proceeds going to the players, teams, and organizations participating in the StarLadder Budapest Major.\n\nAnd don't forget, there's still time to submit picks for the Pick'Em Challenge. All Playoff picks must be submitted prior to the start of the first Playoff match.\n\nGood luck to the 8 remaining teams!",
    "image_url": "https://clan.akamai.steamstatic.com/images/3381077/aefdbaa5f30de1223c8285d17d283eb686e26dd2.png"
  },
  {
    "id": "51b2ad9e79f9701216b29df24c202bea",
    "timestamp": "DECEMBER 6, 2025",
    "link": "https://www.counter-strike.net/newsentry/500591777095353663",
    "entry": "CS2 Workshop Update\n\nToday we are introducing optional Supplemental Terms for releasing Counter-Strike 2 items in-game, found here, which allows the Counter-Strike 2 team to license items for a flat fee, found below:\nWeapon finish: $35,000.00 USD\nSticker: $6,000.00 USD\nCharm: $6,000.00 USD\nIf a Steam account agrees to these new Supplemental Terms, all of the account's Workshop items can now be distributed where Community items were previously not available, such as The Armory. \nA Call to Arms-ory\nAs part of a future update, we are looking for weapon finishes inspired by two themes:\nArabesque Art and Arabian Mythology\nSpy/Tech\nWe are also looking for stickers inspired by two different themes:\nAuto Racing\nFruits and Vegetables\nTo submit weapon finishes and/or stickers to the Call to Arms, select the appropriate option using the updated Counter-Strike 2 Workshop Tool:\nIf you already have Steam Workshop submissions you believe fit into these themes, you will need to re-submit the items and tag them using the options above.\nFinally, today we're releasing the Dr. Boom charm model, which can be painted and submitted for a future community charm collection. And we're adding a new Paint Kit type, Custom Paint Job Extended, which includes options for iridescence and other features.\nWe're excited to see what you come up with!",
    "image_url": "https://clan.akamai.steamstatic.com/images/3381077/8d881c9e69922ab988c6304052979d16bc920346.png"
  },
  {
    "id": "d599f26b2ff2906606daa72895f5f3b0",
    "timestamp": "NOVEMBER 12, 2025",
    "link": "https://www.counter-strike.net/newsentry/578276333072682038",
    "entry": "The Starladder Budapest Major 2025\n\nAs 2025 comes to an end, the StarLadder Budpest Major 2025 is set to begin. Join us as the first stage begins on Monday, November 24th!\nAll three stages of the StarLadder Budapest Major will be played in front of live crowds at MTK Sportpark, and for the first time at a Counter-Strike Major, the Grand Finals will be best of five. Now more than ever, the Major Champions will need to prove their quality by winning three maps in the Active Duty Map Pool.\nMake Your Picks\nYou can begin supporting your favorite teams participating in the Major with the Budapest 2025 Viewer Pass.\nYour activated Budapest 2025 Viewer Pass includes a coin that can be upgraded by playing the Pick'Em challenge. Pass holders gain access to unlimited team graffiti for the duration of the event and can earn and purchase Souvenir Tokens, which can be redeemed for a Souvenir from the match of your choice.\nAnd back by popular demand, Playoff Souvenirs for the StarLadder Budapest Major come with Souvenir Charms, featuring highlights from the match! \nGet Your Stickers\nWith the release of the Viewer Pass and Pick'Em Challenge, we are also releasing StarLadder Budapest Major tournament stickers, featuring logos of every team and signatures of every player participating in the Major. \n\nSlab Your Stickers\nNot ready to apply your favorite sticker? We got you! Today we are introducing Sticker Slabs—charms that let you show off a sticker with no commitment. Later, just break the slab to return the sticker to your inventory.",
    "image_url": "https://clan.fastly.steamstatic.com/images/3381077/9abab962867f9a97482a237d10adfa21ae7e0795.png"
  },
  {
    "id": "d51cdd53b1c02a8b327233955bad4a76",
    "timestamp": "NOVEMBER 5, 2025",
    "link": "https://www.counter-strike.net/newsentry/578276333072678918",
    "entry": "Introducing TrueView\n\nToday we're adding a new feature to demo playback called TrueView.  With TrueView, demo playback will match the player's original experience much more closely.\nPreviously, demo playback showed the server's view of the world, without accounting for network latency. This could be confusing because shots would hit that didn't look like they should have, and vice versa. \nTrueView provides a more accurate representation of the observed player's experience by re-running their client-side prediction.\nThe video below shows the difference between the old demo playback and the same playback with TrueView.\nA few caveats:\nBy default, TrueView is deactivated when the version of the game you are using to view the demo does not match the version of the game used to record the demo.\nEven with TrueView active, there may still be some differences between what you see in the demo and what the player originally saw (especially with slow-motion playback). For example, damage effects will have different timing during demo playback due to the way CPU and GPU work are pipelined.\nIn addition to performing clientside prediction of the observed player, TrueView will also perform Damage Prediction on enemies, if Damage Prediction was used by the observed player at the time. \nAdditionally, we're shipping movement changes that we made available last week in a beta branch. All that and more and today's update!",
    "image_url": "https://clan.akamai.steamstatic.com/images/3381077/8d881c9e69922ab988c6304052979d16bc920346.png"
  },
  {
    "id": "684b73af46ef23252384dbdb511fe8d5",
    "timestamp": "OCTOBER 22, 2025",
    "link": "https://www.counter-strike.net/newsentry/516350567072661952",
    "entry": "Re-Retakes\n\nThe bomb has been planted and you're running out of time. It's the return of retakes! \nIn this classic game mode, each round drops you in to a fast-paced 4v3 after-plant scenario. Select your loadout card each round, check the map to coordinate with your teammates, and use your resources wisely to defuse (or defend) the planted bomb.\nThe clock is ticking, what are you waiting for? Jump into a retakes server now!",
    "image_url": "https://clan.akamai.steamstatic.com/images/3381077/e2a19537713ac31219ddd6f42730425b9fc98df4.png"
  },
  {
    "id": "bdbd6b4ed9c8e9f48f871a9faa64052d",
    "timestamp": "OCTOBER 1, 2025",
    "link": "https://www.counter-strike.net/newsentry/498333631688738072",
    "entry": "Community Maps, Charms, and More\n\nLet's get right into it. Today's update features new Wingman and Competitive community maps, along with brand new charms (including community designs), stickers, and more.\nCommunity Maps\nFrom the mines of Golden to the moving train in Transit, we've got four new Community maps for you to check out. Golden and Palacio have been added to Competitive, Casual, and Deathmatch modes, and Rooftop and Transit have been added to Wingman.\nNew Armory Content\nIt's a lil' HE grenade... for your gun. It doesn't explode, but it sure is charming. Introducing the all new Dr. Boom Charms, now available in the Armory.\nA few months ago we added charms to the workshop, and you responded. For some insight into the creative and occasionally twisted minds of the CS2 community, check out the Missing Link Community Charms in the Armory.\nSpeaking of community designs, the Armory now features two brand new sticker collections, including the return of Sugarface!",
    "image_url": "https://clan.akamai.steamstatic.com/images/3381077/e3dd09af221d416e9535fbd2a1c3ac0c74dfd071.png"
  },
  {
    "id": "84be9c7a88f48db3d2fa34abdc6930ec",
    "timestamp": "SEPTEMBER 16, 2025",
    "link": "https://www.counter-strike.net/newsentry/514095143786120351",
    "entry": "Show Off\n\nHear that? It's the sound of a new update in CS2... and your grenades, which now have unique higher-fidelity sounds for draw, inspect, pin-pull, and throw. For community map makers, there's a new scripting system available along with some examples for you to check out. All that and more in today's update!\n\nSpectator Loadout\n\nFinally, a reason to be happy your teammates are dead. While you're busy clutching, your teammates can peek at your full loadout, inspect your weapons, and possibly offer you unsolicited fashion advice. Stay alive, and show off the best of your collection!\n\nGenesis Collection\n\nIntroducing the Genesis Collection, featuring 17 finishes from community contributors. Genesis Collection items can be accessed via Genesis Uplink Terminals, which are available as a weekly drop.",
    "image_url": "https://clan.akamai.steamstatic.com/images/3381077/69e1b3916a6ecefa7be2fe7262ca2a49eb54b992.png"
  },
  {
    "id": "3872c78d08776b0bd07a32aa6f54a9b2",
    "timestamp": "AUGUST 14, 2025",
    "link": "https://www.counter-strike.net/newsentry/657081807721726187",
    "entry": "Tonight's Forecast: Rain-cient\n\n[p]\nIt's a brand new day (and night) in CS2's tropical maps. Ancient and Shoots have gotten visual upgrades, and now have nighttime versions. The nighttime version of Ancient is only available in Casual and Deathmatch.\n\n\nToday we are releasing the Deluge Music Kit Box, featuring music kits from Adam Beyer, Ghost, HEALTH, James and the Cold Gun, Jonathan Young, Juelz, Killer Mike, PVRIS, Selective Response, and Tigercub. \n\nWe're also refreshing the Limited Time item in the Armory--the M4A1-S | Solitude is now available.\n\n\nReady to check out some night maps? Grab a cup of coffee and go go go! \n\nRelease Notes for today can be found here.[/p]",
    "image_url": "https://clan.akamai.steamstatic.com/images/3381077/e9c4d3e50b38e0fa2e6315ea08f382bfc002cb77.png"
  },
  {
    "id": "0a58f3d1a350c450627ae6d944426a6b",
    "timestamp": "JULY 2, 2025",
    "link": "https://www.counter-strike.net/newsentry/529850584204838951",
    "entry": "BLAST.tv Austin Major Champions\n\nOver four days, the Moody Center in Austin, Texas hosted Team Vitality's coronation as the best Counter-Strike team on the planet.\n\nFacing The MongolZ in the Grand Finals, Team Vitality lost the opening map 13:5, then stormed back on the next two, winning 13:4 on Dust II and 13:6 on Inferno to win the BLAST.tv Austin Major and the organization's second Major Championship.\n\n\nTo celebrate, today we are releasing the Major Champions Capsule, featuring Paper, Foil, Holo, and Gold stickers autographed by one of the Champions from Team Vitality. \n\nAnd for the first time, we are introducing Souvenir Charms. Each Playoff Stage Souvenir comes with a Souvenir Charm that contains a highlight from the match. \n\nFinally, Season Two of Premier ends on July 14th. To receive your Premier Season Two Medal, you must have 25 Season Two Premier wins and a visible CSR when the Season concludes.\n\nSee you soon for Premier Season Three!",
    "image_url": "https://clan.akamai.steamstatic.com/images/3381077/33f2ff8f335e1b76bc58802bf2de498d55662e96.png"
  },
  {
    "id": "aeef76e8cd4b973db882f29c68ddbaa1",
    "timestamp": "JUNE 16, 2025",
    "link": "https://www.counter-strike.net/newsentry/508457312081417562",
    "entry": "Playoffs in Austin\n\nAfter three Stages of the BLAST.tv Austin Major, eight teams have survived and advanced to the Playoffs. The Moody Center will host sold out crowds for four days to determine 2025’s first Major Champions.\n\nStage 3 saw fierce competition, with surprising upsets, come-from-behind victories and too many overtimes to count. There are stories abound in Austin, and every team has forged their own path to this moment. Who will come out on top?\n\nFind out on Thursday, June 19th when the Playoff Stage kicks off between Team Spirit and MOUZ, and don’t forget to make picks for all Playoff Stage matches prior to the start of the first match!\n\nAs we reach the Major’s final stage, there's still time to support your favorite teams. Team and player stickers are available, with 50% of the proceeds going to the players, teams, and organizations participating in the BLAST.tv Austin Major.\n\nSee you in Austin!",
    "image_url": "https://clan.akamai.steamstatic.com/images/3381077/f90784efd087f9a1f98f147c1ccfa4e83d358070.png"
  },
  {
    "id": "66e91ee6402971be4d69427107fe7b36",
    "timestamp": "MAY 29, 2025",
    "link": "https://www.counter-strike.net/newsentry/529848048073835651",
    "entry": "Capture the Moment\n\nThe BLAST.tv Austin Major is fast approaching! \n\nActivate your Austin 2025 Viewer Pass and set your Pick'Ems before the first matches start, and you'll be well on your way to upgrading your Challenge Coin and earning Souvenir Tokens. Speaking of which...\n\nSouvenir Highlight Packages\n\nJust like previous Majors, you'll have the opportunity to claim a memento from the match of your choice. But this time, if you choose a playoff match, you'll receive an all new Souvenir Highlight Package.\n\nAvailable exclusively for playoff stage matches, Souvenir Highlight Packages contain a souvenir weapon with an attached charm that features a video highlight from the playoff map you selected. Your weapon's description will include information about the highlight, and you can view the attached clip in your CS2 inventory, in Steam, or while spectating a teammate in-match.\n\n\nWe're excited for everyone to get their chance to pick up a playoffs-exclusive Souvenir Highlight Package, but they will take some time to put together. So stay tuned—Souvenir Highlight Packages will be redeemable shortly after the Major comes to a close!",
    "image_url": "https://clan.akamai.steamstatic.com/images/3381077/9f48a5e394d528baa2e58ca0c87763522ec5654b.png"
  },
  {
    "id": "53cdc760656b1297daecd1a920115201",
    "timestamp": "MAY 7, 2025",
    "link": "https://www.counter-strike.net/newsentry/529846144626327818",
    "entry": "Mission Possible\n\nToday's update includes several community maps, a rearranging of casual and deathmatch map groups, and the introduction of weekly missions!\n\nWeekly Missions\n\n\n\nYour mission, should you choose to accept it, can be completed for bonus XP. Each week you'll get a new mission, and you can access your mission in the Main Menu and in the Play Menu.\n\nCommunity Maps\n\nToday we welcome a host of new community maps: Jura, Grail and Agency have been added to Competitive, Casual, and Deathmatch modes, and Dogtown and Brewery have been added to Wingman. And it's easier than ever to play community maps—Jura, Grail, and Agency can be found in the new Community Map Group.\n\n \n\nAll this and more (particularly for fans of binding keys to \"/\") in today's update, so jump into some community maps and see what's new!",
    "image_url": "https://clan.akamai.steamstatic.com/images/3381077/74125f34915a42edb24b0c67bd448297217069b1.png"
  },
  {
    "id": "26386cfd953dac944af68a494cfc46a9",
    "timestamp": "MARCH 31, 2025",
    "link": "https://www.counter-strike.net/newsentry/529842339955343453",
    "entry": "Spring Forward\n\nNew weekly care package drop collections, Spring cleaning on Inferno and Train, and an update to content in the Armory—today's update contains a little something for everyone!\n\nNew Drop Collections\nYour weekly care packages just got a bit more interesting. Three new weapon collections have been added to the care package drop list, so keep an eye out for items from the all-new Ascent, Boreal, and Radiant collections. With over 70 new finishes, these collections feature a wide range of styles from solid colors, gold reliefs, camo patterns, custom paint jobs and more.\n\n\nSpring cleaning on Inferno and Train\nWe're also tidying up a few maps. Inferno and Train have undergone some Spring cleaning. You'll notice cleaner surfaces, less clutter, and a slightly wider banana.\n\n\n\nNew additions to the Armory\nThe Armory has received some new offerings, beginning with the all-new Fever Case, featuring 17 weapon finishes from community contributors and Shattered Web knives in Chroma finishes:\n\n\n\nAnd with Train releasing earlier this year, its collection gets a revamp featuring designs inspired by the map's graffiti, location, and more:  \n\n\n\nAnd one more thing, we have added a new Limited Edition Item: the XM1014 | Solitude. Its mountainous pattern comes in a wide range of variations:\n\n\n\nWhat are you waiting for? Jump into a match and check out what's new!",
    "image_url": "https://clan.akamai.steamstatic.com/images/3381077/e29c263c209cdc7d1da7fc9f4543ef6c3ec0c4cd.png"
  },
  {
    "id": "bc518269d5709f2d70fa1036426abeb9",
    "timestamp": "JANUARY 28, 2025",
    "link": "https://www.counter-strike.net/newsentry/520830071182721028",
    "entry": "Season's Greetings\n\nWelcome to Premier Season Two. \n\nIf you haven't heard the news, here's what's new in Season Two. Vertigo is out, Train is in, the M4A4 is more... A4-dable... and we've tweaked the FAMAS. \n\nSeason Two runs from now through the Austin Major, at which point players who meet the requirements will be awarded a Premier Season Two Medal. The color will correspond to your highest CS Rating achieved during the season, and the bars will reflect your total wins, with one bar for every 25—up to five bars.\n\nTo earn your Premier Season Two Medal, you'll need an account in good standing, 25 Premier match wins, and an active CSR at the end of the season.\n\nPremier matchmaking is now open for business, so hit the queue and start racking up those wins!",
    "image_url": "https://clan.akamai.steamstatic.com/images/3381077/4d8798eefa51cfd7286981047bf4490d121c658a.png"
  },
  {
    "id": "e5f193c4ef799fa99159dca5d8c8bee2",
    "timestamp": "DECEMBER 10, 2024",
    "link": "https://www.counter-strike.net/newsentry/528706478197966784",
    "entry": "The 2024 Perfect World Shanghai Major Playoffs\n\nThe Elimination Stage of the 2024 Perfect World Shanghai Major delivered memorable plays, breathtaking clutches, and some of the best 1vX moments in recent memory. And now the final eight teams will battle in front of sold-out crowds at the SPD Bank Oriental Sports Center to become Major Champions.\n\nThe MongolZ and Team Vitality finished the Elimination Stage with perfect 3-0 records. G2 Esports, Team Spirit, and Team Liquid went 3-1, and HEROIC, FaZe Clan, and MOUZ advanced at 3-2.\n\nThe first Playoff match begins Wednesday, December 11th at 22:00 PST between The MongolZ and MOUZ, and all Playoff picks for the Pick'Em Challenge must be made before the match begins!\n\nAs the Major enters its final stage, team and player stickers are still available, with 50% of the proceeds going to the players, teams, and organizations participating in the Perfect World Shanghai Major.\n\nGood luck to the final eight teams!",
    "image_url": "https://clan.akamai.steamstatic.com/images/3381077/60cc608fa2b9e19570455aca7ebe8b1f72469112.png"
  },
  {
    "id": "8154c510274a9a6490d0b86c2ddbe7c9",
    "timestamp": "NOVEMBER 27, 2024",
    "link": "https://www.counter-strike.net/newsentry/4472732402493426409",
    "entry": "Shanghai 2024 Major\n\nThe Counter-Strike Major has come to Shanghai.\n\nOver the past month, teams from around the world challenged the best in their region for their spot in the Major. Now the dust has settled and 24 teams remain--perennial favorites, seasoned veterans, and more than a few newcomers.\n\n\nThe Shanghai Major Hub is now open for business, complete with the Pick'Em Challenge, the Shanghai 2024 Viewer Pass, Souvenirs, Graffiti, and Team and Player stickers. 50% of the proceeds from tournament items are shared with players and organizations.\n\n\nThe Pick'Em Challenge is free to play, but if you want to upgrade your Shanghai 2024 Coin (and earn extra Souvenir Packages), make sure to activate your Viewer Pass before the event begins. You can also compare your Pick'Em performance to other friends with active passes on the Active Pass Leaderboard.\n\n\nIt's time to support your favorite teams. Place your picks, set your graffiti, mark your calendar and get ready, because the Shanghai Major is about to begin. May the best team win!",
    "image_url": "https://clan.akamai.steamstatic.com/images/3381077/917266a706547b62ab34d15d8620c00dc3715031.png"
  },
  {
    "id": "90b8eeed614349dfe436d53bda12ddfc",
    "timestamp": "NOVEMBER 13, 2024",
    "link": "https://www.counter-strike.net/newsentry/4458095069430284354",
    "entry": "All Aboard!\n\nWe're happy to announce the return of the momentarily lost classic, Train.\n\n\n\nThere's plenty of classic Counter-Strike in every inch of this map—but we also made sure to mix up the gameplay a bit to keep you Train veterans on your toes. We also gave it a full visual overhaul, which means your favorite bleak Eastern European train yard is now 60% cloudier. With a chance of rain? We guarantee it.\n\nSo queue up and get ready to master the newest version of one of Counter-Strike's most iconic maps. Train is now available in casual and competitive game modes.\n\nOverpass Updates and New Community Maps\n\n\nOverpass has received a number of updates based on community feedback, and we're adding four new community maps to the game. Basalt returns to Counter-Strike 2 alongside Edin in casual and competitive game modes, and Palais and Whistle have been added to Wingman.",
    "image_url": "https://clan.akamai.steamstatic.com/images/3381077/1100e0c2ca6b52b8df845fdaf20b26a1704d4f0e.png"
  },
  {
    "id": "f9d21e8324bc6bea7c6c0de9281aaec8",
    "timestamp": "OCTOBER 2, 2024",
    "link": "https://www.counter-strike.net/newsentry/4674264042200250912",
    "entry": "The Armory\n\nToday's update introduces the Armory, all new Weapon Charms, and a whole lot more. Click the image below for more details!",
    "image_url": "https://clan.akamai.steamstatic.com/images/3381077/f1a91d7a87158c2287a7bb95162d1df586d816b0.png"
  },
  {
    "id": "34fde9fab14b893fff8cca05a7a2229f",
    "timestamp": "AUGUST 19, 2024",
    "link": "https://www.counter-strike.net/newsentry/6500469346429600836",
    "entry": "Side-stepping Skill\n\nCounter-Strike is constantly evolving. From art, to maps, to inventive plays, and even player input, the CS community shapes the game. \n\nScripting and automating player commands has always been contentious, but over the years some forms of scripting (e.g., jump-throws) have gained acceptance, as they enable plays that wouldn't otherwise be possible. In fact, jump-throws became such an important part of the game that we've done the work to make them reliable without any special scripting or binds (i.e., by jumping and quickly throwing a grenade).\n\nDeveloping one's coordination and reaction time has always been key to mastering Counter-Strike.\n\nRecently, some hardware features have blurred the line between manual input and automation, so we've decided to draw a clear line on what is or isn't acceptable in Counter-Strike.\n\nWe are no longer going to allow automation (via scripting or hardware) that circumvent these core skills and, moving forward, (and initially--exclusively on Valve Official Servers) players suspected of automating multiple player actions from a single game input may be kicked from their match.\n\nTo prevent accidental infractions, in-game binds that include more than one movement and/or attack actions will no longer work (e.g., null-binds and jump-throw binds).\n\nIf you have a keyboard that includes an input-automation feature (e.g., \"Snap Tap Mode\"), be sure to disable the feature before you join a match in order to avoid any interruption to your matches.",
    "image_url": "https://clan.akamai.steamstatic.com/images/3381077/8d881c9e69922ab988c6304052979d16bc920346.png"
  },
  {
    "id": "d60dfcd289a26fe5e5d000c57e37848d",
    "timestamp": "JULY 16, 2024",
    "link": "https://www.counter-strike.net/newsentry/7090437900079084674",
    "entry": "Open Season\n\nLast year we announced the broad strokes of new rules for professional Counter-Strike events, to take effect in 2025. Today, we're filling in the details--click here to see the terms that will be added to Tournament Organizers' license agreements moving forward.\n\nCounter-Strike is at its best when teams compete on a level playing field, and these new rules are part of our commitment to the long-term health of Counter-Strike as a sport. Our goal is to ensure that professional Counter-Strike remains an open sport, where teams are only limited by their ability.\n\nAlthough we expect that there will be some rough edges as we transition to the new requirements, we're excited to see what the future will bring.",
    "image_url": "https://clan.akamai.steamstatic.com/images/3381077/8d881c9e69922ab988c6304052979d16bc920346.png"
  },
  {
    "id": "965f574faed3b65deb5c3c85420a33e2",
    "timestamp": "JUNE 25, 2024",
    "link": "https://www.counter-strike.net/newsentry/4194621169493598732",
    "entry": "The Real MVP\n\nSince the launch of CS2, community map mappers have been hard at work creating new experiences and updating some classics. Today, we're excited to add the first community maps to CS2!\n\n\nFor those of you who dream of Italian weddings, or airplane manufacture (or both!), we've got you covered. Memento and Assembly are now available in Wingman.\n\n\nAnd if you're in the mood for something a bit more... chaotic, take a dip in the classic Pool Day, which is now available in Arms Race.\n\n\nFinally, fight your way through the streets of Thera and Mills in Deathmatch and Casual, and put these maps through their paces in Competitive Matchmaking. \n\nSpeaking of Competitive Matchmaking, we've given map-based skill groups an overhaul. In addition to redistributing players across the Skill Groups, we've also made it easier to earn those badges in the first place.\n\n\n\nThere are a bunch of other fixes and adjustments in today's update, including a brand new MVP panel (and animated MVPs in Premier!) and new ways to optimize your video settings. \n\nJump into a match and check it out!",
    "image_url": "https://clan.akamai.steamstatic.com/images/3381077/4ab4c62e0ee0edef9d852e07cf1e74fa85879130.png"
  },
  {
    "id": "dc43dac7373a635ef0edcd806bbfaa52",
    "timestamp": "MAY 23, 2024",
    "link": "https://www.counter-strike.net/newsentry/4177730135016204539",
    "entry": "Fire Sale\n\nToday's update includes some love for the CT economy, with price cuts to the M4A4 and Incendiary grenade, and a bit less cash going to the T's when the bomb gets defused.\n\n\n\nIn addition to the price cut, the incendiary grenade has gotten a bit of a makeover with a new visual treatment for its explosion and flames, and reduced spread and duration. \n\nAnd in other gameplay news, Vertigo's A-site has gotten some significant changes--it's now the site featured in Wingman matches, so check it out.\n\n\n\nCalling all Kilowatt Collection fans! Now, when you open a Kilowatt case with a key, you'll be given the option to rent the whole collection for a week (excluding the rare special item) instead of keeping a single item. You can play with the weapons as much as you like during that week, but they can't be modified by stickers or nametags.\n\nLots of other changes in today's update, including some quality of life improvements for demo playback, slightly smarter chickens, and a bit of spring cleaning--good news for fans of 'various bug fixes.'\n\nJump into a match and see what's new!",
    "image_url": "https://clan.akamai.steamstatic.com/images/3381077/dce54317de3f18bef0b0cf39a7f02f453f171c35.png"
  },
  {
    "id": "f5d01678f0644e0a7614d2fc903a6fee",
    "timestamp": "APRIL 25, 2024",
    "link": "https://www.counter-strike.net/newsentry/4202497395512481609",
    "entry": "On The Other Hand...\n\nToday's update includes a bunch of quality-of-life improvements that touch upon every part of the game, from maps to UI to gameplay. A few highlights are below, but check out the release notes to see what's new!\n\n\nLefties rejoice! Players can now redeploy their weapons, swapping between the left and right hand. You can set your preferred handedness in the settings menu and then switch hands temporarily mid-round with a key press (H on US Keyboards by default).\n\n\nThe buy menu has a few new tricks. To help you decide whether to buy or save, the top right of the buy menu now features the minimum amount of money you're guaranteed to have next round (thanks Kadomos). And at the bottom you'll find the new 'Dropped Weapons' panel, where you can see (and directly pick up) any weapons that you or teammates have dropped in the buy zone.\n\n\nThere are several more HUD/UI changes in today's update. For those of you who have memorized a library of grenade line-ups, a line-up reticle will appear shortly after you pull the pin (you can even customize the delay for each grenade type). And if you've had trouble navigating through smoke, set a Radar Map Alternate Zoom and add a Toggle Radar Zoom key binding, which will let you switch between zoom levels during a round.\n\n\nWe've updated the Active Duty map pool (for both Premier and competitions), removing Overpass and bringing back Dust II. And there are changes to many other maps, including significant changes to Inferno.\n\nJump right into a match and see what's new, or practice with your friends--practice matches and workshop maps can now be launched with members of your party.",
    "image_url": "https://clan.akamai.steamstatic.com/images/3381077/c3c9a3dc4c493dadce86faaabb76da1fb51e3d65.png"
  },
  {
    "id": "142271c6ef892b7d83f0cbb50fe2b392",
    "timestamp": "JULY 16, 2025",
    "link": "https://www.counter-strike.net/newsentry/529852487375519751",
    "entry": "Season Two: Episode One\n\nPremier Season Three begins today!\n\nIt's time to start working toward your Season Three Medal. As before, the color of your medal will correspond to the highest CS Rating achieved during the season, and the bars will reflect your total wins, with one bar for every 25 (up to five bars). To be eligible for a medal, you'll need an account in good standing, 25 Premier match wins, and an active CSR at the end of the season.\n\nNew for Season 3 \nWith the new season comes an update to the Active Duty Map Pool: Overpass is back in, and Anubis is out.\n\nThere are a few gameplay changes with Season Three. Fire from the incendiary grenade now spreads faster, occupying space rapidly to counter rushing Ts. The MP9 has gotten a bit of a nerf, with a harder to control spray and substantially less jumping accuracy. There's also a change to the CT economy: win or lose, CTs now receive a shared team award for each T eliminated in the round, so the more you win and the closer you keep your losses, the more you'll have to spend.\n\nTrade Protected Items\nToday we are introducing a new feature to help keep your Counter-Strike items secure. In the unlikely event that you lose control of your account or were the target of a scam by a bad actor, you may reverse all Counter-Strike item trades from the last 7 days. \n\nObviously we hope you'll never need it, but you can review your recent trades and find the trade reversal feature on the Trade History page on your Steam Account. For more information about what happens when trades are reversed, visit the FAQ",
    "image_url": "https://clan.akamai.steamstatic.com/images/3381077/d857893890b7fdf0dfe1b674ae1edd7f62fbdec1.png"
  },
  {
    "id": "e1a639242f6c90a642252f0a29d5ca42",
    "timestamp": "JULY 3, 2025",
    "link": "https://www.counter-strike.net/newsentry/529850584204838951",
    "entry": "BLAST.tv Austin Major Champions\n\nOver four days, the Moody Center in Austin, Texas hosted Team Vitality's coronation as the best Counter-Strike team on the planet.\n\nFacing The MongolZ in the Grand Finals, Team Vitality lost the opening map 13:5, then stormed back on the next two, winning 13:4 on Dust II and 13:6 on Inferno to win the BLAST.tv Austin Major and the organization's second Major Championship.\n\n\nTo celebrate, today we are releasing the Major Champions Capsule, featuring Paper, Foil, Holo, and Gold stickers autographed by one of the Champions from Team Vitality. \n\nAnd for the first time, we are introducing Souvenir Charms. Each Playoff Stage Souvenir comes with a Souvenir Charm that contains a highlight from the match. \n\nFinally, Season Two of Premier ends on July 14th. To receive your Premier Season Two Medal, you must have 25 Season Two Premier wins and a visible CSR when the Season concludes.\n\nSee you soon for Premier Season Three!",
    "image_url": "https://clan.akamai.steamstatic.com/images/3381077/33f2ff8f335e1b76bc58802bf2de498d55662e96.png"
  },
  {
    "id": "2156e86548265860a2ee272de886a156",
    "timestamp": "JUNE 22, 2025",
    "link": "https://www.counter-strike.net/newsentry/529849950216913271",
    "entry": "The Final Showdown in Austin\n\nAfter three Stages and six Playoff matchups, two teams have advanced to the Grand Finals of the BLAST.tv Austin Major.\n\nTeam Vitality, the #1 ranked team in the world, defeated Natus Vincere 2-0 in the Quarters and MOUZ 2-1 in the Semis to punch their ticket to the Grand Finals. This is the organization's second Grand Finals appearance and first since they won the Paris 2023 Major.\n\nOn the other side of the Playoff bracket, The MongolZ defeated both FaZe Clan and paiN Gaming 2-0, and now look to become the first Asian team to win a Major Championship.\n\nThe Grand Finals begin tomorrow, June 22nd at 12:30 CDT. Don't miss a second!\n\nAnd as we enter the final day of the BLAST.tv Austin Major, team and player stickers are still available, with 50% of the proceeds going to the players, teams, and participating organizations.\n\nGood luck to both teams!",
    "image_url": "https://clan.akamai.steamstatic.com/images/3381077/1d827b5928ebab786d0d8c2815109bc638236a94.png"
  },
  {
    "id": "cc7cd88ffd2fa4fa74c856cc1b3adbee",
    "timestamp": "JUNE 17, 2025",
    "link": "https://www.counter-strike.net/newsentry/508457312081417562",
    "entry": "Playoffs in Austin\n\nAfter three Stages of the BLAST.tv Austin Major, eight teams have survived and advanced to the Playoffs. The Moody Center will host sold out crowds for four days to determine 2025’s first Major Champions.\n\nStage 3 saw fierce competition, with surprising upsets, come-from-behind victories and too many overtimes to count. There are stories abound in Austin, and every team has forged their own path to this moment. Who will come out on top?\n\nFind out on Thursday, June 19th when the Playoff Stage kicks off between Team Spirit and MOUZ, and don’t forget to make picks for all Playoff Stage matches prior to the start of the first match!\n\nAs we reach the Major’s final stage, there's still time to support your favorite teams. Team and player stickers are available, with 50% of the proceeds going to the players, teams, and organizations participating in the BLAST.tv Austin Major.\n\nSee you in Austin!",
    "image_url": "https://clan.akamai.steamstatic.com/images/3381077/f90784efd087f9a1f98f147c1ccfa4e83d358070.png"
  },
  {
    "id": "790fb60a631fa67ab1177d9b3b81d50c",
    "timestamp": "MAY 30, 2025",
    "link": "https://www.counter-strike.net/newsentry/529848048073835651",
    "entry": "Capture the Moment\n\nThe BLAST.tv Austin Major is fast approaching! \n\nActivate your Austin 2025 Viewer Pass and set your Pick'Ems before the first matches start, and you'll be well on your way to upgrading your Challenge Coin and earning Souvenir Tokens. Speaking of which...\n\nSouvenir Highlight Packages\n\nJust like previous Majors, you'll have the opportunity to claim a memento from the match of your choice. But this time, if you choose a playoff match, you'll receive an all new Souvenir Highlight Package.\n\nAvailable exclusively for playoff stage matches, Souvenir Highlight Packages contain a souvenir weapon with an attached charm that features a video highlight from the playoff map you selected. Your weapon's description will include information about the highlight, and you can view the attached clip in your CS2 inventory, in Steam, or while spectating a teammate in-match.\n\n\nWe're excited for everyone to get their chance to pick up a playoffs-exclusive Souvenir Highlight Package, but they will take some time to put together. So stay tuned—Souvenir Highlight Packages will be redeemable shortly after the Major comes to a close!",
    "image_url": "https://clan.akamai.steamstatic.com/images/3381077/9f48a5e394d528baa2e58ca0c87763522ec5654b.png"
  },
  {
    "id": "5ed8340498327465ffc2c41004228e89",
    "timestamp": "MAY 23, 2025",
    "link": "https://www.counter-strike.net/newsentry/529847413482979949",
    "entry": "BLAST.TV Austin Major 2025\n\nLike a dust storm on the horizon, the BLAST.TV Austin Major is fast approaching. Join us June 3rd as the first stage of the major gets underway!\n\nPick'Em and Stick'Em\nFeaturing more teams than ever before, this Major promises to be the most competitive yet. And you can start supporting your favorite teams today with the Austin 2025 Viewer Pass!\n\n\nYour activated Austin 2025 Viewer Pass includes a coin that you can upgrade by playing the Pick'Em challenge, along with unlimited team graffiti for the duration of the event so you can show your support everywhere you play. You'll also have the opportunity to earn (and purchase) Souvenir Tokens, redeemable for a memento from the match of your choice. \n\n\nAlong with the Viewer Pass and Pick'Em Challenge, today we're releasing tournament stickers featuring the logos of every participating team and the autograph of every participating player. With a bit of Texas flair, Austin Major stickers can be found in a variety of finishes so you can find the perfect look for your collection. \n\n\nSo mark your calendar, dust off your boots, and join us in Austin for Counter-Strike's biggest Major yet!\n\nStick to Your Guns\n\nBut that's not all!\n\nWe've partnered with Games Workshop to celebrate the Warhammer Skulls 2025 event by releasing four Warhammer 40,000-themed sticker capsules.\n\nThemed after Warhammer 40,000 decal sheets, you'll find the Warhammer 40,000 Adeptus Astartes, Traitor Astartes, Imperium, and Xenos Sticker Capsules in-game now!",
    "image_url": "https://clan.akamai.steamstatic.com/images/3381077/6113059092b15dae067ec5c7b8179e62eb37c8c5.png"
  },
  {
    "id": "c6b262b5fb1d0efb2e194f081e37cb98",
    "timestamp": "MAY 8, 2025",
    "link": "https://www.counter-strike.net/newsentry/529846144626327818",
    "entry": "Mission Possible\n\nToday's update includes several community maps, a rearranging of casual and deathmatch map groups, and the introduction of weekly missions!\n\nWeekly Missions\n\n\n\nYour mission, should you choose to accept it, can be completed for bonus XP. Each week you'll get a new mission, and you can access your mission in the Main Menu and in the Play Menu.\n\nCommunity Maps\n\nToday we welcome a host of new community maps: Jura, Grail and Agency have been added to Competitive, Casual, and Deathmatch modes, and Dogtown and Brewery have been added to Wingman. And it's easier than ever to play community maps—Jura, Grail, and Agency can be found in the new Community Map Group.\n\n \n\nAll this and more (particularly for fans of binding keys to \"/\") in today's update, so jump into some community maps and see what's new!",
    "image_url": "https://clan.akamai.steamstatic.com/images/3381077/74125f34915a42edb24b0c67bd448297217069b1.png"
  },
  {
    "id": "1ea2ad3a632edb998fadc7025565c093",
    "timestamp": "APRIL 1, 2025",
    "link": "https://www.counter-strike.net/newsentry/529842339955343453",
    "entry": "Spring Forward\n\nNew weekly care package drop collections, Spring cleaning on Inferno and Train, and an update to content in the Armory—today's update contains a little something for everyone!\n\nNew Drop Collections\nYour weekly care packages just got a bit more interesting. Three new weapon collections have been added to the care package drop list, so keep an eye out for items from the all-new Ascent, Boreal, and Radiant collections. With over 70 new finishes, these collections feature a wide range of styles from solid colors, gold reliefs, camo patterns, custom paint jobs and more.\n\n\nSpring cleaning on Inferno and Train\nWe're also tidying up a few maps. Inferno and Train have undergone some Spring cleaning. You'll notice cleaner surfaces, less clutter, and a slightly wider banana.\n\n\n\nNew additions to the Armory\nThe Armory has received some new offerings, beginning with the all-new Fever Case, featuring 17 weapon finishes from community contributors and Shattered Web knives in Chroma finishes:\n\n\n\nAnd with Train releasing earlier this year, its collection gets a revamp featuring designs inspired by the map's graffiti, location, and more:  \n\n\n\nAnd one more thing, we have added a new Limited Edition Item: the XM1014 | Solitude. Its mountainous pattern comes in a wide range of variations:\n\n\n\nWhat are you waiting for? Jump into a match and check out what's new!",
    "image_url": "https://clan.akamai.steamstatic.com/images/3381077/e29c263c209cdc7d1da7fc9f4543ef6c3ec0c4cd.png"
  },
  {
    "id": "6e338ad83eb0e913421940514e5833c1",
    "timestamp": "JANUARY 29, 2025",
    "link": "https://www.counter-strike.net/newsentry/520830071182721028",
    "entry": "Season's Greetings\n\nWelcome to Premier Season Two. \n\nIf you haven't heard the news, here's what's new in Season Two. Vertigo is out, Train is in, the M4A4 is more... A4-dable... and we've tweaked the FAMAS. \n\nSeason Two runs from now through the Austin Major, at which point players who meet the requirements will be awarded a Premier Season Two Medal. The color will correspond to your highest CS Rating achieved during the season, and the bars will reflect your total wins, with one bar for every 25—up to five bars.\n\nTo earn your Premier Season Two Medal, you'll need an account in good standing, 25 Premier match wins, and an active CSR at the end of the season.\n\nPremier matchmaking is now open for business, so hit the queue and start racking up those wins!",
    "image_url": "https://clan.akamai.steamstatic.com/images/3381077/4d8798eefa51cfd7286981047bf4490d121c658a.png"
  },
  {
    "id": "f81525b1deb30fdb7da48d5964a776d8",
    "timestamp": "JANUARY 25, 2025",
    "link": "https://www.counter-strike.net/newsentry/520829437562848128",
    "entry": "Seasons Change\n\nNext week we will say \"goodbye\" to Premier Season One, and \"hello\" to Season Two. To celebrate, every player who earned a CS Rating during Season One will receive a commemorative Premier Season One Medal. Your medal includes detailed Season Statistics that you can view by clicking on the medal in your inventory. Review your Season One highs and lows with graphs of your CSR and playtime, or view your map-specific stats to find areas of improvement for Season Two.\n\nAs we transition to Season Two, there'll be one day of Premier downtime during which your CS Rating will be recalibrated for the new season based on your Season One performance. At the start of the new Season you will need to re-establish your CS Rating by winning 10 matches.\n\n\nSeason Two comes with some changes. Train is in and Vertigo is out, the M4A4 is a bit less expensive, and the FAMAS has some improvements to its standing and crouching accuracy (along with a price cut).\n\nAnd when Season Two comes to a close after the Austin Major, players who meet the requirements will be awarded a Premier Season Two Medal. The color will correspond to your highest CS Rating achieved during the season, and the bars will reflect your total wins, with one bar for every 25—up to five bars.\n\nTo earn your Premier Season Two Medal, you'll need an account in good standing, 25 Premier match wins, and an active CSR at the end of the season.\n\nSo clear out your calendar, because Season Two is about to begin!",
    "image_url": "https://clan.akamai.steamstatic.com/images/3381077/4d8798eefa51cfd7286981047bf4490d121c658a.png"
  },
  {
    "id": "5eb3591a8f868ec11c2ceb1589052ce2",
    "timestamp": "DECEMBER 19, 2024",
    "link": "https://www.counter-strike.net/newsentry/529833471389991079",
    "entry": "Champions of Shanghai\n\nThe Perfect World Shanghai Grand Final was one to remember. Team Spirit and FaZe Clan needed all three maps to determine a champion in front of an excited, sold-out crowd at the SPD Bank Oriental Sports Center.\n\nDown 12:5 on map 3, FaZe Clan battled back with 6 consecutive round wins—and some incredible clutches along the way—to force round 24. With the bomb planted and down to a 1v1, sh1ro's final kill earned Team Spirit their first Major Championship.\n\nCelebrate Team Spirit's win with the Major Champions Capsule, now available for purchase. The capsule features autographs from Team Spirit in paper, glitter, holo, and gold, and 50% of the proceeds go to the players and organizations.\n\n\nWith Shanghai in the books we look forward to the BLAST.tv Major in Austin, Texas. See you in June 2025!\n\n2025 Service Medal\n\nBeginning January 1st, 2025 players can receive the newest Service Medal in-game. \n\nWhen you reach Global General (Rank 40) you'll have the option to reset your Profile Rank and earn (or upgrade) a 2025 Service Medal.\n\nGood luck and have fun!",
    "image_url": "https://clan.akamai.steamstatic.com/images/3381077/16f56e239c76121d0fa30e277596dcae856f5db1.png"
  },
  {
    "id": "619e76fb3ad39f1709b02600d1ab2e61",
    "timestamp": "DECEMBER 14, 2024",
    "link": "https://www.counter-strike.net/newsentry/707725115500004414",
    "entry": "Crowning a Champion in Shanghai\n\nAfter an exciting Playoff Stage, FaZe Clan and Team Spirit are the last two standing and will meet in the Grand Finals of the Perfect World Shanghai Major.\n\nOn one side of the Playoff bracket, FaZe Clan defeated Team Vitality 2-1 and G2 Esports 2-0 to reach the Grand Finals for the second consecutive Major. \n\nOn the other side, Team Spirit overwhelmed Team Liquid 2-0, then outlasted MOUZ 2-1 on their way to the organization's first Major Grand Finals appearance.\n\nThe Grand Finals begin on December 15th at 01:00 PST and the Showmatch takes place two hours prior. Don't miss a moment!\n\nAnd don't forget, team and player stickers are still available, with 50% of the proceeds going to the players, teams, and organizations participating in the Perfect World Shanghai Major.\n\nBest of luck to both teams!",
    "image_url": "https://clan.akamai.steamstatic.com/images/3381077/13259f7e61b38652d9b396abacc0d9e987dfcffb.png"
  },
  {
    "id": "8e19703eb1e1e1c98d1e326445644f91",
    "timestamp": "DECEMBER 11, 2024",
    "link": "https://www.counter-strike.net/newsentry/528706478197966784",
    "entry": "The 2024 Perfect World Shanghai Major Playoffs\n\nThe Elimination Stage of the 2024 Perfect World Shanghai Major delivered memorable plays, breathtaking clutches, and some of the best 1vX moments in recent memory. And now the final eight teams will battle in front of sold-out crowds at the SPD Bank Oriental Sports Center to become Major Champions.\n\nThe MongolZ and Team Vitality finished the Elimination Stage with perfect 3-0 records. G2 Esports, Team Spirit, and Team Liquid went 3-1, and HEROIC, FaZe Clan, and MOUZ advanced at 3-2.\n\nThe first Playoff match begins Wednesday, December 11th at 22:00 PST between The MongolZ and MOUZ, and all Playoff picks for the Pick'Em Challenge must be made before the match begins!\n\nAs the Major enters its final stage, team and player stickers are still available, with 50% of the proceeds going to the players, teams, and organizations participating in the Perfect World Shanghai Major.\n\nGood luck to the final eight teams!",
    "image_url": "https://clan.akamai.steamstatic.com/images/3381077/60cc608fa2b9e19570455aca7ebe8b1f72469112.png"
  },
  {
    "id": "7ddc848041244d9ee2b525217ce69c78",
    "timestamp": "NOVEMBER 28, 2024",
    "link": "https://www.counter-strike.net/newsentry/4472732402493426409",
    "entry": "Shanghai 2024 Major\n\nThe Counter-Strike Major has come to Shanghai.\n\nOver the past month, teams from around the world challenged the best in their region for their spot in the Major. Now the dust has settled and 24 teams remain--perennial favorites, seasoned veterans, and more than a few newcomers.\n\n\nThe Shanghai Major Hub is now open for business, complete with the Pick'Em Challenge, the Shanghai 2024 Viewer Pass, Souvenirs, Graffiti, and Team and Player stickers. 50% of the proceeds from tournament items are shared with players and organizations.\n\n\nThe Pick'Em Challenge is free to play, but if you want to upgrade your Shanghai 2024 Coin (and earn extra Souvenir Packages), make sure to activate your Viewer Pass before the event begins. You can also compare your Pick'Em performance to other friends with active passes on the Active Pass Leaderboard.\n\n\nIt's time to support your favorite teams. Place your picks, set your graffiti, mark your calendar and get ready, because the Shanghai Major is about to begin. May the best team win!",
    "image_url": "https://clan.akamai.steamstatic.com/images/3381077/917266a706547b62ab34d15d8620c00dc3715031.png"
  },
  {
    "id": "9a878814c106f169cb4b378813d2cf6f",
    "timestamp": "NOVEMBER 14, 2024",
    "link": "https://www.counter-strike.net/newsentry/4458095069430284354",
    "entry": "All Aboard!\n\nWe're happy to announce the return of the momentarily lost classic, Train.\n\n\n\nThere's plenty of classic Counter-Strike in every inch of this map—but we also made sure to mix up the gameplay a bit to keep you Train veterans on your toes. We also gave it a full visual overhaul, which means your favorite bleak Eastern European train yard is now 60% cloudier. With a chance of rain? We guarantee it.\n\nSo queue up and get ready to master the newest version of one of Counter-Strike's most iconic maps. Train is now available in casual and competitive game modes.\n\nOverpass Updates and New Community Maps\n\n\nOverpass has received a number of updates based on community feedback, and we're adding four new community maps to the game. Basalt returns to Counter-Strike 2 alongside Edin in casual and competitive game modes, and Palais and Whistle have been added to Wingman.",
    "image_url": "https://clan.akamai.steamstatic.com/images/3381077/1100e0c2ca6b52b8df845fdaf20b26a1704d4f0e.png"
  },
  {
    "id": "badd37e7f713e736c7c3dc544cdf462e",
    "timestamp": "OCTOBER 3, 2024",
    "link": "https://www.counter-strike.net/newsentry/4674264042200250912",
    "entry": "The Armory\n\nToday's update introduces the Armory, all new Weapon Charms, and a whole lot more. Click the image below for more details!",
    "image_url": "https://clan.akamai.steamstatic.com/images/3381077/f1a91d7a87158c2287a7bb95162d1df586d816b0.png"
  },
  {
    "id": "83447e9bc058ef7406b331a50a3cee71",
    "timestamp": "AUGUST 20, 2024",
    "link": "https://www.counter-strike.net/newsentry/6500469346429600836",
    "entry": "Side-stepping Skill\n\nCounter-Strike is constantly evolving. From art, to maps, to inventive plays, and even player input, the CS community shapes the game. \n\nScripting and automating player commands has always been contentious, but over the years some forms of scripting (e.g., jump-throws) have gained acceptance, as they enable plays that wouldn't otherwise be possible. In fact, jump-throws became such an important part of the game that we've done the work to make them reliable without any special scripting or binds (i.e., by jumping and quickly throwing a grenade).\n\nDeveloping one's coordination and reaction time has always been key to mastering Counter-Strike.\n\nRecently, some hardware features have blurred the line between manual input and automation, so we've decided to draw a clear line on what is or isn't acceptable in Counter-Strike.\n\nWe are no longer going to allow automation (via scripting or hardware) that circumvent these core skills and, moving forward, (and initially--exclusively on Valve Official Servers) players suspected of automating multiple player actions from a single game input may be kicked from their match.\n\nTo prevent accidental infractions, in-game binds that include more than one movement and/or attack actions will no longer work (e.g., null-binds and jump-throw binds).\n\nIf you have a keyboard that includes an input-automation feature (e.g., \"Snap Tap Mode\"), be sure to disable the feature before you join a match in order to avoid any interruption to your matches.",
    "image_url": "https://clan.akamai.steamstatic.com/images/3381077/8d881c9e69922ab988c6304052979d16bc920346.png"
  },
  {
    "id": "fff485408462d45b4b6c8421842a416b",
    "timestamp": "JULY 17, 2024",
    "link": "https://www.counter-strike.net/newsentry/7090437900079084674",
    "entry": "Open Season\n\nLast year we announced the broad strokes of new rules for professional Counter-Strike events, to take effect in 2025. Today, we're filling in the details--click here to see the terms that will be added to Tournament Organizers' license agreements moving forward.\n\nCounter-Strike is at its best when teams compete on a level playing field, and these new rules are part of our commitment to the long-term health of Counter-Strike as a sport. Our goal is to ensure that professional Counter-Strike remains an open sport, where teams are only limited by their ability.\n\nAlthough we expect that there will be some rough edges as we transition to the new requirements, we're excited to see what the future will bring.",
    "image_url": "https://clan.akamai.steamstatic.com/images/3381077/8d881c9e69922ab988c6304052979d16bc920346.png"
  },
  {
    "id": "8466c5f73260083687049647daf33ec7",
    "timestamp": "JUNE 26, 2024",
    "link": "https://www.counter-strike.net/newsentry/4194621169493598732",
    "entry": "The Real MVP\n\nSince the launch of CS2, community map mappers have been hard at work creating new experiences and updating some classics. Today, we're excited to add the first community maps to CS2!\n\n\nFor those of you who dream of Italian weddings, or airplane manufacture (or both!), we've got you covered. Memento and Assembly are now available in Wingman.\n\n\nAnd if you're in the mood for something a bit more... chaotic, take a dip in the classic Pool Day, which is now available in Arms Race.\n\n\nFinally, fight your way through the streets of Thera and Mills in Deathmatch and Casual, and put these maps through their paces in Competitive Matchmaking. \n\nSpeaking of Competitive Matchmaking, we've given map-based skill groups an overhaul. In addition to redistributing players across the Skill Groups, we've also made it easier to earn those badges in the first place.\n\n\n\nThere are a bunch of other fixes and adjustments in today's update, including a brand new MVP panel (and animated MVPs in Premier!) and new ways to optimize your video settings. \n\nJump into a match and check it out!",
    "image_url": "https://clan.akamai.steamstatic.com/images/3381077/4ab4c62e0ee0edef9d852e07cf1e74fa85879130.png"
  },
  {
    "id": "abab3511173140659ba3b6ccf0e1c0f0",
    "timestamp": "MAY 24, 2024",
    "link": "https://www.counter-strike.net/newsentry/4177730135016204539",
    "entry": "Fire Sale\n\nToday's update includes some love for the CT economy, with price cuts to the M4A4 and Incendiary grenade, and a bit less cash going to the T's when the bomb gets defused.\n\n\n\nIn addition to the price cut, the incendiary grenade has gotten a bit of a makeover with a new visual treatment for its explosion and flames, and reduced spread and duration. \n\nAnd in other gameplay news, Vertigo's A-site has gotten some significant changes--it's now the site featured in Wingman matches, so check it out.\n\n\n\nCalling all Kilowatt Collection fans! Now, when you open a Kilowatt case with a key, you'll be given the option to rent the whole collection for a week (excluding the rare special item) instead of keeping a single item. You can play with the weapons as much as you like during that week, but they can't be modified by stickers or nametags.\n\nLots of other changes in today's update, including some quality of life improvements for demo playback, slightly smarter chickens, and a bit of spring cleaning--good news for fans of 'various bug fixes.'\n\nJump into a match and see what's new!",
    "image_url": "https://clan.akamai.steamstatic.com/images/3381077/dce54317de3f18bef0b0cf39a7f02f453f171c35.png"
  },
  {
    "id": "f5b01ce399de95d1461526c2520aa238",
    "timestamp": "APRIL 26, 2024",
    "link": "https://www.counter-strike.net/newsentry/4202497395512481609",
    "entry": "On The Other Hand...\n\nToday's update includes a bunch of quality-of-life improvements that touch upon every part of the game, from maps to UI to gameplay. A few highlights are below, but check out the release notes to see what's new!\n\n\nLefties rejoice! Players can now redeploy their weapons, swapping between the left and right hand. You can set your preferred handedness in the settings menu and then switch hands temporarily mid-round with a key press (H on US Keyboards by default).\n\n\nThe buy menu has a few new tricks. To help you decide whether to buy or save, the top right of the buy menu now features the minimum amount of money you're guaranteed to have next round (thanks Kadomos). And at the bottom you'll find the new 'Dropped Weapons' panel, where you can see (and directly pick up) any weapons that you or teammates have dropped in the buy zone.\n\n\nThere are several more HUD/UI changes in today's update. For those of you who have memorized a library of grenade line-ups, a line-up reticle will appear shortly after you pull the pin (you can even customize the delay for each grenade type). And if you've had trouble navigating through smoke, set a Radar Map Alternate Zoom and add a Toggle Radar Zoom key binding, which will let you switch between zoom levels during a round.\n\n\nWe've updated the Active Duty map pool (for both Premier and competitions), removing Overpass and bringing back Dust II. And there are changes to many other maps, including significant changes to Inferno.\n\nJump right into a match and see what's new, or practice with your friends--practice matches and workshop maps can now be launched with members of your party.",
    "image_url": "https://clan.akamai.steamstatic.com/images/3381077/c3c9a3dc4c493dadce86faaabb76da1fb51e3d65.png"
  }
]